In [20]:
import pandas as pd
tab = {
    'UK': {2001: 30, 2002: 35, 2003: 102, 2004: 24},
    'USA': {2001: 12, 2002: 23, 2003: 67, 2004: 87},
    'Japan': {2001: 21, 2002: 98, 2003: 14, 2004: 65}
}
df_tab = pd.DataFrame(tab)
df_tab

       UK  USA  Japan
2001   30   12     21
2002   35   23     98
2003  102   67     14
2004   24   87     65

In [47]:
loc_slice = df_tab.loc[2001:2003] 
loc_slice

       UK  USA  Japan
2001   30   12     21
2002   35   23     98
2003  102   67     14

In [46]:
iloc_slice = df_tab.iloc[0:2] 
iloc_slice

      UK  USA  Japan
2001  30   12     21
2002  35   23     98

In [66]:
import numpy as np
df1 = pd.DataFrame(np.arange(15).reshape((3,5)), 
                   columns=list('VWXYZ'), 
                   index=['UK', 'USA', 'Japan'])
df1

        V   W   X   Y   Z
UK      0   1   2   3   4
USA     5   6   7   8   9
Japan  10  11  12  13  14

In [67]:
df1.pow(2)

         V    W    X    Y    Z
UK       0    1    4    9   16
USA     25   36   49   64   81
Japan  100  121  144  169  196

In [75]:
series1 = pd.Series(range(4), index=['V', 'W', 'X', 'Y'])
series1

V    0
W    1
X    2
Y    3
dtype: int64

In [76]:
df1 + series1

          V     W     X     Y   Z
UK      0.0   2.0   4.0   6.0 NaN
USA     5.0   7.0   9.0  11.0 NaN
Japan  10.0  12.0  14.0  16.0 NaN

ValueError: cannot reshape array of size 20 into shape (3,5)